--------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  D:\wbStata\datasets\opentest-log.txt
  log type:  text
 opened on:  11 Feb 2023, 16:06:41

. version 13

. 
. txt2macro manifest.txt

. local datasets `r(mymacro)'

. dis "`datasets'"
auto auto2 bplong cancer census citytemp educ99gdp gnp96 lifeexp nlsw88 pop2000 sp500 uslife
> exp uslifeexp2 voter

. 
. * Should fail to open in Stata 13
. foreach data of local datasets {
  2.         cap use `rootdir'/`data'.dta
  3.         assert _rc==610
  4. }

. 
. * Should open in Stata 13
. foreach data of local datasets {
  2.         cap use `rootdir'/wbstata/`data'-wbstata.dta
  3.         dis _rc
  4.         assert _rc==0
  5. }
0
0
0
0
0
0
0
0
0
0
0
0
0
0
0

. 
. log close
      name:  <unnamed>
       log:  D:\wbStata\datasets\opentest-log.txt
  log type:  text
 closed on:  11 Feb 2023, 16:06:41
--------------------------------------------------------------------------------------------
